In [1]:
%pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.17.0-py3-none-any.whl.metadata (34 kB)
Requirement already satisfied: ipython in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython-sql) (9.10.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading sqlalchemy-2.0.46-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl.metadata (9.5 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.5-py3-none-any.whl.metadata (4.7 kB)
Requirement already satisfied: six in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython-sql) (1.17.0)
Collecting ipython-genutils (from ipython-sql)
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Collecting greenlet>=1 (from sqlalchemy>=2.0->ipython-sql)
  Downloading greenlet-3.3.1-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (3.7 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy>=2.0->ipython-sql)
  Downloading typing_extensions-4.15.0-py3-none-any.whl.metadata (3.3 kB)
Requirement already satisfied: decorator>=4.3.2 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers>=1.0.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.18.1 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline>=0.1.5 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments>=2.11.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: stack_data>=0.6.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from prettytable->ipython-sql) (0.5.3)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from jedi>=0.18.1->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (3.0.1)
Requirement already satisfied: pure-eval in /home/avenable11/CSCI210-0AC-FW-202530-Demos/test_env/lib/python3.12/site-packages (from stack_data>=0.6.0->ipython->ipython-sql) (0.2.3)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading sqlalchemy-2.0.46-cp312-cp312-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl (3.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.3/3.3 MB 8.7 MB/s eta 0:00:0000:0100:01
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.17.0-py3-none-any.whl (34 kB)
Downloading sqlparse-0.5.5-py3-none-any.whl (46 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 46.1/46.1 kB 3.5 MB/s eta 0:00:00
Downloading greenlet-3.3.1-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (609 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 609.9/609.9 kB 8.1 MB/s eta 0:00:0000:0100:01
Downloading typing_extensions-4.15.0-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.6/44.6 kB 4.9 MB/s eta 0:00:00
Installing collected packages: ipython-genutils, typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-3.3.1 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.17.0 sqlalchemy-2.0.46 sqlparse-0.5.5 typing-extensions-4.15.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
import sqlalchemy
sqlalchemy.create_engine('sqlite:///ConstructCo.db')

Engine(sqlite:///ConstructCo.db)

In [3]:
import sqlite3
%reload_ext sql
%sql sqlite:///ConstructCo.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

# Select everything from the job table

In [4]:
%%sql
select * from job

 * sqlite:///ConstructCo.db
Done.

[('500', 'Programmer', 35.75, '2017-11-20'),
 ('501', 'Systems Analyst', 96.75, '2017-11-20'),
 ('502', 'Database Designer', 125.0, '2018-03-24'),
 ('503', 'Electrical Engineer', 84.5, '2017-11-20'),
 ('504', 'Mechanical Engineer', 67.9, '2017-11-20'),
 ('505', 'Civil Engineer', 55.78, '2017-11-20'),
 ('506', 'Clerical Support', 26.87, '2017-11-20'),
 ('507', 'DSS Analyst', 45.95, '2017-11-20'),
 ('508', 'Applications Designer', 48.1, '2018-03-24'),
 ('509', 'Bio Technician', 34.55, '2017-11-20'),
 ('510', 'General Support', 18.36, '2017-11-20')]

# Select the list of project names from the project table

In [6]:
%%sql
select proj_name from project

 * sqlite:///ConstructCo.db
Done.

[('Evergreen',), ('Amber Wave',), ('Rolling Tide',), ('Starflight',)]

# Select the first name, last name and hire date for all employees with the job code 504.

In [11]:
%%sql
select emp_fname, emp_lname, emp_hiredate from employee where job_code = '504'

 * sqlite:///ConstructCo.db
Done.

[]

In [9]:
%%sql
select cus_fname, cus_lname, cus_hiredate from employee where job_code == '504'

 * sqlite:///ConstructCo.db
(sqlite3.OperationalError) no such column: cus_fname
[SQL: select cus_fname, cus_lname, cus_hiredate from employee where job_code == '504']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Select first name and last name combined for all employees

In [15]:
%%sql
select distinct emp_fname || ' ' ||  emp_lname as `Employee Name`
from employee

 * sqlite:///ConstructCo.db
Done.

[('John News',),
 ('David Senior',),
 ('June Arbough',),
 ('Anne Ramoras',),
 ('Alice Johnson',),
 ('William Smithfield',),
 ('Maria Alonzo',),
 ('Ralph Washington',),
 ('Larry Smith',),
 ('Gerald Olenko',),
 ('Geoff Wabash',),
 ('Darlene Smithson',),
 ('Delbert Joenbrood',),
 ('Annelise Jones',),
 ('Travis Bawangi',),
 ('Gerald Pratt',),
 ('Angie Williamson',),
 ('James Frommer',)]

# Select the first name, last name and hire date for all employees with the job code 510 who have 16 years or less on the job.

In [16]:
%%sql
select emp_fname, emp_lname, emp_hiredate
from employee
where (job_code == '510') and (emp_years <= '16')

 * sqlite:///ConstructCo.db
Done.

[('James', 'Frommer', '2005-01-04')]

In [17]:
%%sql
select emp_fname, emp_lname, emp_hiredate from employee where job_code = '510' and emp_years < 16

 * sqlite:///ConstructCo.db
Done.

[('James', 'Frommer', '2005-01-04')]

In [25]:
%%sql
select emp_fname, emp_lname, emp_hiredate
from employee 
where 
emp_hiredate >= date('now', '-16 years')

 * sqlite:///ConstructCo.db
Done.

[]

# Select all charges from March 23, 2018

In [27]:
%%sql
select *
from assignment
where assign_date == '2018-03-23'

 * sqlite:///ConstructCo.db
Done.

[(1009, '2018-03-23', '15', '115', '501', 96.75, 5.6, 541.8),
 (1010, '2018-03-23', '15', '117', '509', 34.55, 2.4, 82.92),
 (1011, '2018-03-23', '25', '105', '502', 105.0, 4.3, 451.5),
 (1012, '2018-03-23', '18', '108', '501', 96.75, 3.4, 328.95),
 (1013, '2018-03-23', '25', '115', '501', 96.75, 2.0, 193.5),
 (1014, '2018-03-23', '22', '104', '501', 96.75, 2.8, 270.9),
 (1015, '2018-03-23', '15', '103', '503', 84.5, 6.1, 515.45),
 (1016, '2018-03-23', '22', '105', '502', 105.0, 4.7, 493.5),
 (1017, '2018-03-23', '18', '117', '509', 34.55, 3.8, 131.29),
 (1018, '2018-03-23', '25', '117', '509', 34.55, 2.2, 76.01)]

# Select the job codes for project 22 where the charge is greater than $400.

In [28]:
%%sql
select assign_job
from assignment
where proj_num == 22 and assign_charge > 400

 * sqlite:///ConstructCo.db
Done.

[('501',), ('502',), ('501',), ('502',)]